In [1]:
import pandas as pd

In [3]:
import os

In [4]:
print(os.getcwd())

C:\Users\drism

In [6]:
df = pd.read_csv('C:/Users/drism/Documents/Amex_Project/data/amex_data.csv')

In [9]:
df.head()

,customer_id,offer_id,event_ts,event_dt,offer_action,var_1,var_2,var_3,var_4,var_5,...,var_41,var_42,var_43,var_44,var_45,var_46,var_47,var_48,var_49,var_50
0,1010494,601711,2023-11-01 10:25:21.000904,2023-11-01 00:00:00,1,NaN,NaN,NaN,NaN,NaN,...,0.089583,0.083204,2151.0,0.0,0.0,0.0,0.0,0.0,True,0.0
1,1010494,33452,2023-11-09 08:37:35.165000,2023-11-09 00:00:00,0,NaN,NaN,NaN,NaN,NaN,...,0.111752,0.181776,1668.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
2,1010494,88456737,2023-11-01 10:15:55.000489,2023-11-01 00:00:00,1,NaN,NaN,NaN,NaN,NaN,...,0.088514,NaN,NaN,0.0,0.0,0.0,0.0,0.0,1.0,0.0
3,1010494,390981,2023-11-01 10:27:27.000313,2023-11-01 00:00:00,1,NaN,NaN,NaN,NaN,NaN,...,0.086931,0.059246,3678.0,0.0,False,0.0,0.0,0.0,1.0,0.0
4,1010494,7114,2023-11-09 08:37:38.553000,2023-11-09 00:00:00,0,NaN,NaN,NaN,NaN,NaN,...,0.089497,0.124221,3619.0,0.0,0.0,0.0,False,0.0,1.0,0.0

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2004812 entries, 0 to 2004811
Data columns (total 55 columns):
 #   Column        Dtype
---  ------        -----
 0   customer_id   int64
 1   offer_id      int64
 2   event_ts      object
 3   event_dt      object
 4   offer_action  object
 5   var_1         float64
 6   var_2         float64
 7   var_3         float64
 8   var_4         float64
 9   var_5         float64
 10  var_6         float64
 11  var_7         float64
 12  var_8         float64
 13  var_9         float64
 14  var_10        float64
 15  var_11        float64
 16  var_12        float64
 17  var_13        float64
 18  var_14        float64
 19  var_15        float64
 20  var_16        float64
 21  var_17        float64
 22  var_18        float64
 23  var_19        float64
 24  var_20        float64
 25  var_21        float64
 26  var_22        float64
 27  var_23        float64
 28  var_24        float64
 29  var_25        float64
 30  var_26        float64
 31  var_27        float64
 32  var_28        float64
 33  var_29        float64
 34  var_30        float64
 35  var_31        float64
 36  var_32        float64
 37  var_33        float64
 38  var_34        float64
 39  var_35        float64
 40  var_36        float64
 41  var_37        float64
 42  var_38        float64
 43  var_39        float64
 44  var_40        float64
 45  var_41        float64
 46  var_42        float64
 47  var_43        float64
 48  var_44        float64
 49  var_45        object
 50  var_46        object
 51  var_47        object
 52  var_48        float64
 53  var_49        object
 54  var_50        object
dtypes: float64(45), int64(2), object(8)
memory usage: 841.3+ MB

In [11]:
df.describe()

,customer_id,offer_id,var_1,var_2,var_3,var_4,var_5,var_6,var_7,var_8,...,var_36,var_37,var_38,var_39,var_40,var_41,var_42,var_43,var_44,var_48
count,2.004812e+06,2.004812e+06,769235.000000,939953.000000,295718.000000,198259.000000,1.443714e+06,1.674323e+06,1.125559e+06,1.437420e+06,...,27275.000000,1.286100e+06,2.004759e+06,1.857870e+06,1.857870e+06,1.678014e+06,1.846806e+06,1.846806e+06,2004759.0,2.004759e+06
mean,1.465379e+06,2.020622e+07,33.973431,32.409650,33.640363,40.631689,3.438814e+01,3.770162e+01,3.613842e+01,3.649525e+01,...,12.835197,2.730998e-01,9.571012e+01,7.011631e+03,9.357645e+04,1.175265e-01,1.181813e-01,3.258467e+03,0.0,7.507137e-02
std,2.594202e+05,9.972241e+07,22.039018,20.558765,24.717924,28.877784,2.151217e+01,1.955954e+01,2.261652e+01,2.120697e+01,...,17.266552,1.658929e-01,5.228714e+01,3.399906e+03,5.284505e+04,9.326043e-02,9.600510e-02,1.062592e+03,0.0,2.635065e-01
min,1.000125e+06,1.185000e+03,1.000000,1.000000,1.000000,1.000000,1.000000e+00,1.000000e+00,1.000000e+00,1.000000e+00,...,-33.000000,2.500000e-02,3.000000e+00,0.000000e+00,1.000000e+00,0.000000e+00,1.964834e-02,1.000000e+00,0.0,0.000000e+00
25%,1.249353e+06,6.768100e+04,13.000000,19.000000,13.000000,22.000000,1.800000e+01,2.500000e+01,2.000000e+01,2.000000e+01,...,20.000000,2.000000e-01,6.000000e+01,4.482000e+03,4.067200e+04,7.826103e-02,7.333775e-02,2.932000e+03,0.0,0.000000e+00
50%,1.467485e+06,9.671300e+04,34.000000,31.000000,31.000000,40.000000,3.400000e+01,3.700000e+01,3.500000e+01,3.600000e+01,...,20.000000,2.000000e-01,9.100000e+01,7.662000e+03,1.086210e+05,9.042495e-02,9.285426e-02,3.458000e+03,0.0,0.000000e+00
75%,1.692897e+06,6.358690e+05,46.000000,44.000000,47.000000,64.000000,4.500000e+01,4.700000e+01,4.700000e+01,4.700000e+01,...,23.000000,3.000000e-01,1.220000e+02,9.079000e+03,1.432130e+05,1.147157e-01,1.287612e-01,3.957000e+03,0.0,0.000000e+00
max,1.910509e+06,8.766658e+08,100.000000,100.000000,100.000000,100.000000,1.000000e+02,1.000000e+02,1.000000e+02,1.000000e+02,...,33.000000,2.000000e+00,1.357000e+03,3.510200e+04,1.763500e+05,1.000000e+00,1.000000e+00,5.704000e+03,0.0,1.000000e+00

In [12]:
df['event_ts'] = pd.to_datetime(df['event_ts'])
df['event_dt'] = pd.to_datetime(df['event_dt'])

ValueError: time data "09 Nov 2023 08:37" doesn't match format "%Y-%m-%d %H:%M:%S.%f", at position 7. You might want to try:
    - passing `format` if your strings have a consistent format;
    - passing `format='ISO8601'` if your strings are all ISO8601 but not necessarily in exactly the same format;
    - passing `format='mixed'`, and the format will be inferred for each element individually. You might want to use `dayfirst` alongside this.

In [13]:
df['event_ts'] = pd.to_datetime(df['event_ts'], format='mixed')
df['event_dt'] = pd.to_datetime(df['event_dt'], format='mixed')

In [14]:
print("Date columns converted successfully!")

Date columns converted successfully!

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2004812 entries, 0 to 2004811
Data columns (total 55 columns):
 #   Column        Dtype
---  ------        -----
 0   customer_id   int64
 1   offer_id      int64
 2   event_ts      datetime64[ns]
 3   event_dt      datetime64[ns]
 4   offer_action  object
 5   var_1         float64
 6   var_2         float64
 7   var_3         float64
 8   var_4         float64
 9   var_5         float64
 10  var_6         float64
 11  var_7         float64
 12  var_8         float64
 13  var_9         float64
 14  var_10        float64
 15  var_11        float64
 16  var_12        float64
 17  var_13        float64
 18  var_14        float64
 19  var_15        float64
 20  var_16        float64
 21  var_17        float64
 22  var_18        float64
 23  var_19        float64
 24  var_20        float64
 25  var_21        float64
 26  var_22        float64
 27  var_23        float64
 28  var_24        float64
 29  var_25        float64
 30  var_26        float64
 31  var_27        float64
 32  var_28        float64
 33  var_29        float64
 34  var_30        float64
 35  var_31        float64
 36  var_32        float64
 37  var_33        float64
 38  var_34        float64
 39  var_35        float64
 40  var_36        float64
 41  var_37        float64
 42  var_38        float64
 43  var_39        float64
 44  var_40        float64
 45  var_41        float64
 46  var_42        float64
 47  var_43        float64
 48  var_44        float64
 49  var_45        object
 50  var_46        object
 51  var_47        object
 52  var_48        float64
 53  var_49        object
 54  var_50        object
dtypes: datetime64[ns](2), float64(45), int64(2), object(6)
memory usage: 841.3+ MB

In [16]:
import sqlite3

In [17]:
conn = sqlite3.connect('amex_challenge.db')

In [18]:
print("Database connection established successfully.")

Database connection established successfully.

In [19]:
df.to_sql('clickstream', conn, if_exists='replace', index=False)

2004812

In [20]:
print("DataFrame has been successfully written to the SQL table 'clickstream'.")

DataFrame has been successfully written to the SQL table 'clickstream'.

In [21]:
sql_query = "SELECT * FROM clickstream LIMIT 5;"

In [22]:
pd.read_sql_query(sql_query, conn)

,customer_id,offer_id,event_ts,event_dt,offer_action,var_1,var_2,var_3,var_4,var_5,...,var_41,var_42,var_43,var_44,var_45,var_46,var_47,var_48,var_49,var_50
0,1010494,601711,2023-11-01 10:25:21.000904,2023-11-01 00:00:00,1,None,None,None,None,None,...,0.089583,0.083204,2151.0,0.0,0.0,0.0,0.0,0.0,True,0.0
1,1010494,33452,2023-11-09 08:37:35.165000,2023-11-09 00:00:00,0,None,None,None,None,None,...,0.111752,0.181776,1668.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
2,1010494,88456737,2023-11-01 10:15:55.000489,2023-11-01 00:00:00,1,None,None,None,None,None,...,0.088514,NaN,NaN,0.0,0.0,0.0,0.0,0.0,1.0,0.0
3,1010494,390981,2023-11-01 10:27:27.000313,2023-11-01 00:00:00,1,None,None,None,None,None,...,0.086931,0.059246,3678.0,0.0,False,0.0,0.0,0.0,1.0,0.0
4,1010494,7114,2023-11-09 08:37:38.553000,2023-11-09 00:00:00,0,None,None,None,None,None,...,0.089497,0.124221,3619.0,0.0,0.0,0.0,False,0.0,1.0,0.0

In [23]:

q1_preprocessing_query = """
/*
A CTE is like a temporary table. This one calculates the number of days since a user's last visit.
The LAG() function is a powerful tool that can 'look back' at the previous row for the same customer.
*/
WITH ActivityStatus AS (
    SELECT
        rowid, -- SQLite's unique identifier for each row
        customer_id,
        event_ts,
        JULIANDAY(event_ts) - JULIANDAY(LAG(event_ts, 1, '1900-01-01') OVER (PARTITION BY customer_id ORDER BY event_ts)) AS days_since_last_visit
    FROM
        clickstream
)
-- This final SELECT joins the original data with our calculation to create the 'is_active_user' flag.
SELECT
    c.*,
    CASE 
        WHEN a.days_since_last_visit <= 30 THEN 1 
        ELSE 0 
    END AS is_active_user
FROM
    clickstream c
JOIN
    ActivityStatus a ON c.rowid = a.rowid;
"""


df_final = pd.read_sql_query(q1_preprocessing_query, conn)

df_final.to_sql('clickstream_final', conn, if_exists='replace', index=False)

print("Final clickstream table created with 'is_active_user' flag. Ready to answer Question 1.")

Final clickstream table created with 'is_active_user' flag. Ready to answer Question 1.

In [25]:
# Let's inspect all the columns that contain non-numerical data
object_columns = df.select_dtypes(include='object').columns

print("--- Inspecting columns to find 'offer_category' --- \n")

for col in object_columns:
    # We check for nulls first, then get unique values
    if df[col].isnull().all():
        print(f"Column '{col}' is all nulls.\n")
    else:
        print(f"--- Unique values in column: {col} ---")
        # Show up to the first 10 unique values to keep the output clean
        print(df[col].dropna().unique()[:10])
        print("\n")

--- Inspecting columns to find 'offer_category' ---

--- Unique values in column: offer_action ---
['1' '0' 'False' 'True']


--- Unique values in column: var_45 ---
['0.0' 'False' '1.0' 'True']


--- Unique values in column: var_46 ---
['0.0' 'False' '1.0' 'True']


--- Unique values in column: var_47 ---
['0.0' 'False']


--- Unique values in column: var_49 ---
['True' '1.0' '0.0' 'False']


--- Unique values in column: var_50 ---
['0.0' 'False' 'True' '1.0']

In [26]:

var_columns = [col for col in df.columns if 'var_' in col]

unique_counts = df[var_columns].nunique()

print("Number of unique values in each 'var' column (showing top candidates):")
print(unique_counts.sort_values().head(15))

Number of unique values in each 'var' column (showing top candidates):
var_22     1
var_31     1
var_44     1
var_48     2
var_16     2
var_47     2
var_49     4
var_50     4
var_46     4
var_45     4
var_14    12
var_36    14
var_33    15
var_15    15
var_35    22
dtype: int64

In [27]:

q1_1_corrected_query = """
SELECT
    is_active_user,
    var_49 AS offer_category_encoded,
    SUM(CASE WHEN offer_action = '1' THEN 1.0 ELSE 0.0 END) / COUNT(*) AS ctr
FROM
    clickstream_final
GROUP BY
    is_active_user, offer_category_encoded
ORDER BY
    offer_category_encoded, is_active_user;
"""
result_1_1 = pd.read_sql_query(q1_1_corrected_query, conn)
print("Click-Through Rates by Category and User Activity:")
print(result_1_1)

print("\n--- Analysis ---")
print("To find your answer, compare the 'ctr' for the same 'offer_category_encoded' between is_active_user=0 and is_active_user=1.")
print("If you see a category where the CTR for active users (1) is noticeably higher than for inactive users (0), the statement is TRUE.")

Click-Through Rates by Category and User Activity:
   is_active_user offer_category_encoded       ctr
0               0                   None  0.000000
1               1                   None  0.057692
2               0                    0.0  0.163192
3               1                    0.0  0.052981
4               0                    1.0  0.134974
5               1                    1.0  0.053333
6               0                  False  0.108861
7               1                  False  0.051871
8               0                   True  0.153299
9               1                   True  0.053126

--- Analysis ---
To find your answer, compare the 'ctr' for the same 'offer_category_encoded' between is_active_user=0 and is_active_user=1.
If you see a category where the CTR for active users (1) is noticeably higher than for inactive users (0), the statement is TRUE.

In [28]:
q1_2_corrected_query = """
SELECT
    is_active_user,
    AVG(var_43) AS avg_discount_saved
FROM
    clickstream_final
WHERE
    offer_action = '1' -- Only for offers that were clicked
GROUP BY
    is_active_user;
"""
result_1_2 = pd.read_sql_query(q1_2_corrected_query, conn)
print(result_1_2)

# Logic to determine the answer
if result_1_2.loc[1, 'avg_discount_saved'] > result_1_2.loc[0, 'avg_discount_saved']:
    print("\nAnswer 1.2 is: TRUE")
else:
    print("\nAnswer 1.2 is: FALSE")

   is_active_user  avg_discount_saved
0               0         2780.684486
1               1         3003.129487

Answer 1.2 is: TRUE

In [29]:
# We will use the encoded category '1.0' to represent 'Airline' for this calculation.
q1_3_corrected_query = """
SELECT
    COUNT(DISTINCT customer_id) AS customer_count
FROM
    clickstream_final
WHERE
    is_active_user = 1
    AND var_49 = '1.0'
    AND offer_action = '1';
"""
result_1_3 = pd.read_sql_query(q1_3_corrected_query, conn)

print(f"\nAnswer 1.3 is: {result_1_3.loc[0, 'customer_count']}")

Answer 1.3 is: 8867

In [30]:

# We exclude offers with no discount value, as per the note in the problem.
df_for_median = pd.read_sql_query("SELECT var_42 FROM clickstream_final WHERE var_42 > 0;", conn)
median_value = df_for_median['var_42'].median()

print(f"The 50th Percentile (Median) for 'var_42' is: {median_value}\n")


q2_query = f"""
/* This CTE calculates the conversion rate for High and Low tier offers separately */
WITH OfferTiers AS (
    SELECT
        var_49 AS offer_category_encoded,
        CASE WHEN var_42 >= {median_value} THEN 'High' ELSE 'Low' END as discount_tier,
        offer_action
    FROM
        clickstream_final
    WHERE
        var_42 > 0 -- Exclude offers with no discount value
),
/* This CTE calculates the CTR for each group */
CtrByTier AS (
    SELECT
        offer_category_encoded,
        discount_tier,
        SUM(CASE WHEN offer_action = '1' THEN 1.0 ELSE 0.0 END) / COUNT(*) AS ctr
    FROM
        OfferTiers
    GROUP BY
        offer_category_encoded, discount_tier
)
/* Final query pivots the data to calculate the difference */
SELECT
    offer_category_encoded,
    MAX(CASE WHEN discount_tier = 'High' THEN ctr END) - MAX(CASE WHEN discount_tier = 'Low' THEN ctr END) AS ctr_difference
FROM
    CtrByTier
GROUP BY
    offer_category_encoded;
"""

result_2 = pd.read_sql_query(q2_query, conn)

print("Difference in Conversion Rates (High - Low Discount):")
print(result_2)

The 50th Percentile (Median) for 'var_42' is: 0.0928542576613046

Difference in Conversion Rates (High - Low Discount):
  offer_category_encoded  ctr_difference
0                   None             NaN
1                    0.0        0.035716
2                    1.0        0.034736
3                  False        0.035702
4                   True        0.034943

In [31]:
# Step 1: Create a new table in our database with customer spending segments
q3_segment_query = """
-- First, create a temporary table of each customer's max spend (using our hypothesized spend column var_36)
WITH CustomerMaxSpend AS (
    SELECT
        customer_id,
        MAX(var_36) as max_spend
    FROM
        clickstream_final
    GROUP BY
        customer_id
)
-- Now, assign each customer to a tier (1=Low, 2=Medium, 3=High)
SELECT
    customer_id,
    NTILE(3) OVER (ORDER BY max_spend) as spend_tier
FROM
    CustomerMaxSpend;
"""
df_segments = pd.read_sql_query(q3_segment_query, conn)
# Save these segments to a new table for easy access
df_segments.to_sql('customer_segments', conn, if_exists='replace', index=False)
print("Customer spending segments created successfully.\n")


# Step 2: Calculate the AVERAGE REWARD RATE OF OFFERS OFFERED to each category (Answer 3.1)
q3_offered_rate_query = """
SELECT
    s.spend_tier,
    AVG(c.var_41) as avg_offered_rate -- using hypothesized reward rate column var_41
FROM
    clickstream_final c
JOIN
    customer_segments s ON c.customer_id = s.customer_id
WHERE
    c.var_41 IS NOT NULL
GROUP BY
    s.spend_tier;
"""
df_offered = pd.read_sql_query(q3_offered_rate_query, conn)
print("--- Answer 3.1: Average Rate of OFFERS OFFERED ---")
print(df_offered)
print("\n")


# Step 3: Calculate the AVERAGE REWARD RATE OF OFFERS PARTICIPATED IN (Answer 3.2)
q3_participated_rate_query = """
SELECT
    s.spend_tier,
    AVG(c.var_41) as avg_participated_rate
FROM
    clickstream_final c
JOIN
    customer_segments s ON c.customer_id = s.customer_id
WHERE
    c.offer_action = '1' -- The only difference is we filter for clicked offers
    AND c.var_41 IS NOT NULL
GROUP BY
    s.spend_tier;
"""
df_participated = pd.read_sql_query(q3_participated_rate_query, conn)
print("--- Answer 3.2: Average Rate of OFFERS PARTICIPATED IN ---")
print(df_participated)
print("\n")


# Step 4: Determine the BEST PERFORMING SEGMENT (Answer 3.3)
# We merge the two results and calculate a performance ratio
df_performance = pd.merge(df_offered, df_participated, on='spend_tier')
df_performance['performance_ratio'] = df_performance['avg_participated_rate'] / df_performance['avg_offered_rate']

# Find the tier with the highest ratio
best_segment_tier = df_performance.loc[df_performance['performance_ratio'].idxmax()]
tier_map = {1: 'LOW', 2: 'MEDIUM', 3: 'HIGH'}
best_segment_name = tier_map[best_segment_tier['spend_tier']]

print("--- Answer 3.3: Best Performing Segment ---")
print(f"The best performing segment is: {best_segment_name}")

Customer spending segments created successfully.

--- Answer 3.1: Average Rate of OFFERS OFFERED ---
   spend_tier  avg_offered_rate
0           1          0.114204
1           2          0.116447
2           3          0.120047


--- Answer 3.2: Average Rate of OFFERS PARTICIPATED IN ---
   spend_tier  avg_participated_rate
0           1               0.127139
1           2               0.134591
2           3               0.134119


--- Answer 3.3: Best Performing Segment ---
The best performing segment is: MEDIUM

In [32]:
import pandas as pd

# Step 1: Calculate the average offer presentation count (our threshold)
avg_presentations_query = "SELECT COUNT(*) * 1.0 / COUNT(DISTINCT offer_id) FROM clickstream_final;"
avg_presentations = pd.read_sql_query(avg_presentations_query, conn).iloc[0, 0]
print(f"The average offer presentation count is: {avg_presentations}\n")

# Step 2: Find the Top 10 Offers by Conversion Rate (Answer 4.1)
# Using our hypotheses: var_49 is offer category
top_10_offers_query = f"""
WITH OfferPerformance AS (
    SELECT
        offer_id,
        var_49 AS offer_category_encoded,
        COUNT(*) as times_viewed,
        SUM(CASE WHEN offer_action = '1' THEN 1.0 ELSE 0.0 END) as times_clicked
    FROM clickstream_final
    GROUP BY offer_id, offer_category_encoded
)
SELECT
    offer_id,
    offer_category_encoded,
    times_clicked / times_viewed AS conversion_rate
FROM
    OfferPerformance
WHERE
    times_viewed > {avg_presentations} -- Apply the threshold
ORDER BY
    conversion_rate DESC
LIMIT 10;
"""
df_top_10 = pd.read_sql_query(top_10_offers_query, conn)
print("--- Answer 4.1: Top 10 Offer ID to Offer Category Mappings ---")
print(df_top_10)
print("\n")

# Create a list of the top 10 offer IDs to use in the next queries
top_10_offer_ids = df_top_10['offer_id'].tolist()
# We need to format this list for use in an SQL "IN" clause
top_10_ids_str = ', '.join(map(str, top_10_offer_ids))


# Step 3: Find the average 3-month spend of customers for these offers (Answer 4.2)
# Using our hypothesis: var_36 is spend amount. Date is as of Nov 7, 2023.
avg_spend_query = f"""
SELECT
    AVG(var_36) as avg_3_month_spend
FROM
    clickstream_final
WHERE
    customer_id IN (
        SELECT DISTINCT customer_id
        FROM clickstream_final
        WHERE offer_id IN ({top_10_ids_str}) AND offer_action = '1'
    )
    AND event_dt BETWEEN '2023-08-07' AND '2023-11-07'; -- Last 3 months from Nov 7
"""
avg_spend = pd.read_sql_query(avg_spend_query, conn).iloc[0, 0]
print(f"--- Answer 4.2: Average 3-Month Spend of Customers ---")
print(f"{avg_spend}\n")


# Step 4: Find the average conversion rate for these offers over the last 30 days (Answer 4.3)
recent_ctr_query = f"""
SELECT
    offer_id,
    SUM(CASE WHEN offer_action = '1' THEN 1.0 ELSE 0.0 END) / COUNT(*) as recent_conversion_rate
FROM
    clickstream_final
WHERE
    offer_id IN ({top_10_ids_str})
    AND event_dt BETWEEN '2023-10-08' AND '2023-11-07' -- Last 30 days from Nov 7
GROUP BY
    offer_id;
"""
df_recent_ctr = pd.read_sql_query(recent_ctr_query, conn)
print("--- Answer 4.3: Recent Conversion Rate for Top 10 Offers ---")
print(df_recent_ctr)

The average offer presentation count is: 2421.2705314009663

--- Answer 4.1: Top 10 Offer ID to Offer Category Mappings ---
   offer_id offer_category_encoded  conversion_rate
0      2788                    1.0         0.243088
1     60448                    1.0         0.194751
2     25852                    0.0         0.176562
3    281783                    1.0         0.145514
4      1185                    0.0         0.141065
5    159555                    1.0         0.129280
6    689367                    1.0         0.125460
7    331980                    1.0         0.124890
8    633765                    1.0         0.124448
9    498907                    0.0         0.122201


--- Answer 4.2: Average 3-Month Spend of Customers ---
12.614209673686647

--- Answer 4.3: Recent Conversion Rate for Top 10 Offers ---
   offer_id  recent_conversion_rate
0      1185                0.188679
1      2788                0.319006
2     25852                0.219003
3     60448                0.253623
4    159555                0.184534
5    281783                0.173222
6    331980                0.148816
7    498907                0.138073
8    633765                0.164625
9    689367                0.157512

In [33]:
# Create a new folder for our clean data
import os
if not os.path.exists('data_cleaned'):
    os.makedirs('data_cleaned')

# Save the main results from Q2, Q3, and Q4 into new CSV files
result_2.to_csv('data_cleaned/question_2_results.csv', index=False)
df_performance.to_csv('data_cleaned/question_3_results.csv', index=False)
df_top_10.to_csv('data_cleaned/question_4_top_10_offers.csv', index=False)

print("Key result files have been saved to the 'data_cleaned' folder.")

Key result files have been saved to the 'data_cleaned' folder.